# CreateViaCopy Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoop..::..CreateViaCopy Method
CurveLoop Class See Also
---
Creates a new curve loop as a copy of the input.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static CurveLoop CreateViaCopy(
	CurveLoop original
)
```

Visual Basic
---
```text
Public Shared Function CreateViaCopy ( _
	original As CurveLoop _
) As CurveLoop
```

Visual C++
---
```text
public:
static CurveLoop^ CreateViaCopy(
	CurveLoop^ original
)
```

# ### Parameters
original
    Type: Autodesk.Revit.DB..::..CurveLoop The original curve loop.
# ### Return Value
The copied curve loop.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
CurveLoop Class
Autodesk.Revit.DB Namespace